Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/irish_constitution_1/constitution_introduction.html.txt.tmx
Source language: en
Languages: ga

source: The Irish Constitution was enacted in 1937
ga: Achtaíodh Bunreacht na hÉireann i 1937

source: It is the fundamental legal document that sets out how Ireland should be governed through a series of 50 Articles
ga: Is doiciméad dlí bunúsach é a dhéanann cur síos i 50 Alt ar an mbealach ba chóir Éire a rialú

source: Every part of the Constitution is set out in both the Irish and English language
ga: Leagtar amach gach cuid den Bhunreacht i nGaeilge agus i mBéarla

source: The Irish title of the Constitution is Bunreacht na hEireann
ga: 'Bunreacht na hÉireann' atá mar theideal Gaeilge ar an mBunreacht

source: The Constitution establishes the branches or organs of government, it establishes the courts and it also sets out how those institutions should be run
ga: Cuireann an Bunreacht brainsí nó orgain an rialtais ar bun, cuireann sé na cúirteanna ar bun, agus leagann sé síos an bealach inar ceart iad a eagrú

source: The Constitution also describes the fundamental rights of every Irish citizen
ga: Tá feidhm tábhachtach eile ag an mBunreacht; Déanann sé cur síos ar na bunchearta atá ag chuile shaoránach Éireannach

source: One of the most important Articles of the Constitution is Article 15.4, which states that the Oireachtas must not enact any law that is repugnant to the Constitution and that any such law is invalid
ga: Ceann de na hAilt is tábhachtaí sa Bhunreacht ná Alt 15.4, a shonraíonn nach féidir leis an Oireachtas dlí ar bith a achtú atá aimhréireach leis an mBunreacht agus go bhfuil dlí den sórt sin neamhbhailí

source: This means that the Constitution is superior to all other law
ga: Ciallaíonn sé seo go bhfuil forlámhas ag dlí an Bhunreachta ar gach dlí eile lena n-áirítear reachtaíocht

source: If a proposed new law is repugnant to the Constitution, it cannot be enacted without first changing the Constitution by a constitutional referendum
ga: Má bhíonn dlí nua-mholta aimhréireach leis an mBunreacht, ní féidir é a achtú gan an Bunreacht a athrú i dtús báire trí reifreann bunreachtúil

source: The Constitution consists of 2 main parts
ga: Tá 2 phríomhchuid sa Bhunreacht

source: • The fundamental rights of the citizen
ga: • Cearta bunúsacha an tsaoránaigh

source: Read more about how an amendment of the Constitution is made and what happens where unconstitutional legislation and decisions arise
ga: Léigh tuilleadh faoin mbealach a dhéantar leasú Bunreachta agus cad a tharlaíonn in Éirinn maidir le cinntí agus reachtaíocht mhíbhunreachtúil
